ERP.belugaerp/src/Catalogs/Справки1ЕГАИС/Справки1ЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Справки1ЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_ДатаГТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРозлива</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/Справки1ЕГАИС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьПоляГТД();
	бг_ДобавитьПолеКрепость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПоляГТД()
	
	бг_ДобавитьПолеНомерГТД();
	бг_ДобавитьПолеДатаГТД();
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеНомерГТД()
	
	бг_НомерГТД = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НомерГТД",
		,
		"Объект.бг_НомерГТД");
	бг_НомерГТД.АвтоМаксимальнаяШирина = Ложь;
	бг_НомерГТД.МаксимальнаяШирина = 25;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеДатаГТД()
	
	бг_ДатаГТД = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДатаГТД",
		,
		"Объект.бг_ДатаГТД");
	бг_ДатаГТД.АвтоМаксимальнаяШирина = Ложь;
	бг_ДатаГТД.МаксимальнаяШирина = 25;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеКрепость()
	
	бг_Крепость = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Крепость",
		,
		"Объект.бг_Крепость");
	бг_Крепость.АвтоМаксимальнаяШирина = Ложь;
	бг_Крепость.МаксимальнаяШирина = 25;
	
КонецПроцедуры

#КонецОбласти
